HumidityAndCorrosion/system/solid/fvOptions
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidAbsoluteEnergySource
{
    type            scalarSemiImplicitSource;
    active          true;

    scalarSemiImplicitSourceCoeffs
    {
        selectionMode   cellZone;          // 选择模式：单元格区域
        cellZone        solid;             // 作用的单元格区域名称
        volumeMode      absolute;          // 源项模式：绝对能量（W）

        sources
        {
            h                               // 作用于固体区域的焓场h
            {
                explicit        10000;        // 显式源项值（100W，absolute模式）
                implicit        0;          // 隐式系数（0=完全显式）
            }
        }
    }
}

solidCpDegradation
{
    type            scalarSemiImplicitSource;
    active          yes;


    scalarSemiImplicitSourceCoeffs
    {
        selectionMode   all; 
        fields (h);

        volumeMode  specific;

        injectionRateSuSp
        {
            h   (0  -5);
        }
    }
}

// ************************************************************************* //